In [10]:
people = {
    "first": ["Kiyo", 'Jane', 'John', 'Adam'], 
    "last": ["Ndux", 'Doe', 'Doe', 'Del'], 
    "email": ["rmvilla987@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com', 'Adam@yahoo.com']
}

In [11]:
import pandas as pd

In [12]:
df = pd.DataFrame(people)

In [13]:
df

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com
3  Adam   Del        Adam@yahoo.com

In [14]:
df.sort_values(by='last')

  first  last                 email
3  Adam   Del        Adam@yahoo.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com
0  Kiyo  Ndux  rmvilla987@gmail.com

In [15]:
df.sort_values(by='last', ascending=False)

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com
3  Adam   Del        Adam@yahoo.com

In [16]:
df.sort_values(by=['last', 'first'], ascending=False)

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
2  John   Doe     JohnDoe@email.com
1  Jane   Doe     JaneDoe@email.com
3  Adam   Del        Adam@yahoo.com

In [18]:
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)

In [19]:
df

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com
3  Adam   Del        Adam@yahoo.com

In [20]:
df.sort_index()

  first  last                 email
0  Kiyo  Ndux  rmvilla987@gmail.com
1  Jane   Doe     JaneDoe@email.com
2  John   Doe     JohnDoe@email.com
3  Adam   Del        Adam@yahoo.com

In [22]:
df['last'].sort_values()

3     Del
1     Doe
2     Doe
0    Ndux
Name: last, dtype: object